knieriem/tinygo-stm32-svd/svd/stm32u535.svd
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>RCC control/status register</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <resetValue>0x0C004400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MSIKSRANGE</name>
              <description>MSIK range after Standby mode
This bit is set by software to chose the MSIK frequency at startup. It is used after exiting Standby mode until MSIRGSEL is set. After a NRST pin or a power-on reset or when exiting Shutdown mode, the range is always 4�MHz. MSIKSRANGE can be written only when MSIRGSEL = 1.
others: reserved
Note: Changing this bitfield does not change the current MSIK frequency.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>MSIKSRANGE</name>
                <enumeratedValue>
                  <name>f_4MHz</name>
                  <description>Range 4 around 4 MHz</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>f_2MHz</name>
                  <description>Range 5 around 2 MHz</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>f_1_33MHz</name>
                  <description>Range 6 around 1.33 MHz</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>f_1MHz</name>
                  <description>Range 7 around 1 MHz</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>f_3_072MHz</name>
                  <description>Range 8 around 3.072 MHz</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSISSRANGE</name>
              <description>MSIS range after Standby mode
This bitfield is set by software to chose the MSIS frequency at startup. It is used after exiting Standby mode until MSIRGSEL is set. After a NRST pin or a power-on reset or when exiting Shutdown mode, the range is always 4�MHz. MSISSRANGE can be written only when MSIRGSEL = 1.
others: reserved
Note: Changing this bitfield does not change the current MSIS frequency.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="MSIKSRANGE"/>
            </field>
            <field>
              <name>RMVF</name>
              <description>Remove reset flag
This bit is set by software to clear the reset flags.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RMVFW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear the reset flags</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>Option-byte loader reset flag
This bit is set by hardware when a reset from the option-byte loading occurs. It is cleared by�writing to the RMVF bit.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>OBLRSTFR</name>
                <enumeratedValue>
                  <name>NotOccured</name>
                  <description>No reset from option-byte loading occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occured</name>
                  <description>Reset from option-byte loading occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>NRST pin reset flag
This bit is set by hardware when a reset from the NRST pin occurs. It is cleared by writing to�the RMVF bit.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>PINRSTFR</name>
                <enumeratedValue>
                  <name>NotOccured</name>
                  <description>No reset from NRST pin occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occured</name>
                  <description>Reset from NRST pin occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>Brownout reset or an exit from Shutdown mode reset flag
This bit is set by hardware when a brownout reset or an exit from Shutdown mode reset occurs. It is cleared by writing to the RMVF bit.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>BORRSTFR</name>
                <enumeratedValue>
                  <name>NotOccured</name>
                  <description>No BOR/exit from Shutdown mode reset occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occured</name>
                  <description>BOR/exit from Shutdown mode reset occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Software reset flag
This bit is set by hardware when a software reset occurs. It is cleared by writing to RMVF.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SFTRSTFR</name>
                <enumeratedValue>
                  <name>NotOccured</name>
                  <description>No software reset occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occured</name>
                  <description>Software reset occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>Independent watchdog reset flag
This bit is set by hardware when an independent watchdog reset domain occurs. It is cleared by writing to the RMVF bit.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>IWDGRSTFR</name>
                <enumeratedValue>
                  <name>NotOccured</name>
                  <description>No independent watchdog reset occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occured</name>
                  <description>Independent watchdog reset occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <description>Window watchdog reset flag
This bit is set by hardware when a window watchdog reset occurs. It is cleared by writing to�the RMVF bit.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>WWDGRSTFR</name>
                <enumeratedValue>
                  <name>NotOccured</name>
                  <description>No window watchdog reset occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occured</name>
                  <description>Window watchdog reset occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>Low-power reset flag
This bit is set by hardware when a reset occurs due to a Stop, Standby, or Shutdown mode entry, whereas the corresponding NRST_STOP, NRST_STBY, or NRST_SHDW option bit is cleared. This bit is cleared by writing to the RMVF bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>LPWRRSTFR</name>
                <enumeratedValue>
                  <name>NotOccured</name>
                  <description>No illegal low-power mode reset occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Occured</name>
                  <description>Illegal low-power mode reset occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR</name>
          <displayName>SECCFGR</displayName>
          <description>RCC secure configuration register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSISEC</name>
              <description>HSI clock configuration and status bit security
This bit is set and reset by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>HSISEC</name>
                <enumeratedValue>
                  <name>NonSecure</name>
                  <description>Nonsecure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Secure</name>
                  <description>Secure</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSESEC</name>
              <description>HSE clock configuration bits, status bit and HSE_CSS security
This bit is set and reset by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>MSISEC</name>
              <description>MSI clock configuration and status bit security
This bit is set and reset by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>LSISEC</name>
              <description>LSI clock configuration and status bit security
This bit is set and reset by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>LSESEC</name>
              <description>LSE clock configuration and status bit security
This bit is set and reset by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>SYSCLKSEC</name>
              <description>SYSCLK clock selection, STOPWUCK bit, clock output on MCO configuration security
This bit is set and reset by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>PRESCSEC</name>
              <description>AHBx/APBx prescaler configuration bits security
This bit is set and reset by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>PLL1SEC</name>
              <description>PLL1 clock configuration and status bit security
This bit is set and reset by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>PLL2SEC</name>
              <description>PLL2 clock configuration and status bit security
Set and reset by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>PLL3SEC</name>
              <description>PLL3 clock configuration and status bit security
This bit is set and reset by software.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>ICLKSEC</name>
              <description>Intermediate clock source selection security
This bit is set and reset by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>HSI48SEC</name>
              <description>HSI48 clock configuration and status bit security
This bit is set and reset by software.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
            <field>
              <name>RMVFSEC</name>
              <description>Remove reset flag security
This bit is set and reset by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HSISEC"/>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR</name>
          <displayName>PRIVCFGR</displayName>
          <description>RCC privilege configuration register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPRIV</name>
              <description>RCC secure function privilege configuration
This bit is set and reset by software. It can be written only by a secure privileged access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SPRIV</name>
                <enumeratedValue>
                  <name>Unprivileged</name>
                  <description>Read and write to RCC secure functions can be done by privileged or unprivileged access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged</name>
                  <description>Read and write to RCC secure functions can be done by privileged access only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSPRIV</name>
              <description>RCC non-secure function privilege configuration
This bit is set and reset by software. It can be written only by privileged access, secure or non-secure.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>NSPRIV</name>
                <enumeratedValue>
                  <name>Unprivileged</name>
                  <description>Read and write to RCC nonsecure functions can be done by privileged or unprivileged access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Privileged</name>
                  <description>Read and write to RCC nonsecure functions can be done by privileged access only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
